In [46]:
import pandas as pd
import numpy as np

In [47]:
df = pd.DataFrame()  # An Empty Dataframw

In [48]:
df

Empty DataFrame
Columns: []
Index: []

In [49]:
#DataFrame can be created using a single list or a list of lists. 
List=['Abhas','Rohan','Ambar','Devarka','Gaurav']  # list of strings
df = pd.DataFrame(List)
df

         0
0    Abhas
1    Rohan
2    Ambar
3  Devarka
4   Gaurav

In [50]:
# initialise data of lists.
data = {'Name':['Tom', 'nick', 'krish', 'jack'], 'Age':[20, 21, 19, 18]}

In [51]:
# Create DataFrame
df = pd.DataFrame(data)
 
# Print the output.
df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [52]:
#Create pandas dataframe from lists using dictionary: 
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict)
df

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [53]:
df.head()   #top 5 rows of data frame are returned

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [54]:
df.head(9)   # we can also specify the number of series to be viewed

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [55]:
df.tail()

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [56]:
df.tail(1)

    name degree  score
3  Geeku    MBA     98

In [57]:
df.describe()

           score
count   4.000000
mean   77.000000
std    25.742313
min    40.000000
25%    70.000000
50%    85.000000
75%    92.000000
max    98.000000

In [58]:
df.columns

Index(['name', 'degree', 'score'], dtype='object')

In [59]:
List2=[1,2,3,4,5,6,7,8]   
df1=pd.Series(List2)    # Creating a Pandas Series with Python Lists
df1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [60]:
# creating an empty series
empty=pd.Series([])
empty

Series([], dtype: object)

In [61]:
a=pd.Series(['Abhas Jaiswal','Devarka Mullick','Ambar Gairola','Vivaan Jain'],index=[10,11,12,13,]) # we can provide index manually
a

10      Abhas Jaiswal
11    Devarka Mullick
12      Ambar Gairola
13        Vivaan Jain
dtype: object

In [62]:
# we can provide a name to the series.
a=pd.Series(['Abhas Jaiswal','Devarka Mullick','Ambar Gairola','Vivaan Jain'],index=[10,11,12,13,],name='Student Data')
a

10      Abhas Jaiswal
11    Devarka Mullick
12      Ambar Gairola
13        Vivaan Jain
Name: Student Data, dtype: object

In [63]:
scaler_series=pd.Series(0.5)
scaler_series

0    0.5
dtype: float64

In [64]:
scaler_series=pd.Series(0.5,index=[0,1,2])
scaler_series

0    0.5
1    0.5
2    0.5
dtype: float64

# PANDA SERIES WITH PYTHON DICTIONARY

In [65]:
dict_series=pd.Series({'Name':'Abhas Jaiswal','Branch':'B.Tech CSE in Data Science'},name='Studnet_Data')
dict_series

Name                   Abhas Jaiswal
Branch    B.Tech CSE in Data Science
Name: Studnet_Data, dtype: object

In [66]:
max(dict_series)

'B.Tech CSE in Data Science'

In [67]:
new=[{'a':5,'b':6,'c':9,'d':10},{'a':1,'b':2,'c':3,'d':0}]   # Dicitionary key represents columns
df = pd.DataFrame(new)
df

   a  b  c   d
0  5  6  9  10
1  1  2  3   0

In [68]:
b = {'RollNo.':pd.Series([1,2,3,4,5]), 
    'Maths':pd.Series([67,89,23,90,56]), 
    'Physics':pd.Series([12,98,44,90,78])}      

df = pd.DataFrame(b)
df

   RollNo.  Maths  Physics
0        1     67       12
1        2     89       98
2        3     23       44
3        4     90       90
4        5     56       78

# Reading CSV FILE

In [69]:
csv_file=("DailyDelhiClimateTrain.csv")    # Loading Dataframe
df=pd.read_csv(csv_file)

In [70]:
df.columns    # displays the columns present in the dataframe

Index(['date', 'meantemp', 'humidity', 'wind_speed', 'meanpressure'], dtype='object')

In [71]:
df.shape   # (1462,5)=(rows,columns)

(1462, 5)

In [72]:
df.size   #  It gives the number of cells present in the dataframe

7310

In [73]:
df.head()

         date   meantemp   humidity  wind_speed  meanpressure
0  2013-01-01  10.000000  84.500000    0.000000   1015.666667
1  2013-01-02   7.400000  92.000000    2.980000   1017.800000
2  2013-01-03   7.166667  87.000000    4.633333   1018.666667
3  2013-01-04   8.666667  71.333333    1.233333   1017.166667
4  2013-01-05   6.000000  86.833333    3.700000   1016.500000

In [77]:
df.describe()

          meantemp     humidity   wind_speed  meanpressure
count  1462.000000  1462.000000  1462.000000   1462.000000
mean     25.495521    60.771702     6.802209   1011.104548
std       7.348103    16.769652     4.561602    180.231668
min       6.000000    13.428571     0.000000     -3.041667
25%      18.857143    50.375000     3.475000   1001.580357
50%      27.714286    62.625000     6.221667   1008.563492
75%      31.305804    72.218750     9.238235   1014.944901
max      38.714286   100.000000    42.220000   7679.333333

count: Total Number of Non-Empty values
mean: Mean of the column values
std: Standard Deviation of the column values
min: Minimum value from the column
25%: 25 percentile
50%: 50 percentile
75%: 75 percentile
max: Maximum value from the column

In [78]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1462 entries, 0 to 1461
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          1462 non-null   object
 1   meantemp      1462 non-null   float64
 2   humidity      1462 non-null   float64
 3   wind_speed    1462 non-null   float64
 4   meanpressure  1462 non-null   float64
dtypes: float64(4), object(1)
memory usage: 57.2+ KB

In [79]:
csv_file2='Restaurant.csv'
df2=pd.read_csv('Restaurant.csv')
df2

,Rank,Restaurant,Content,Sales,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
0,1,McDonald's,NaN,40412,4.9%,13846,-0.5%,NaN,Quick Service & Burger
1,2,Starbucks,NaN,21380,8.6%,15049,3.0%,NaN,Quick Service & Coffee Cafe
2,3,Chick-fil-A,While Popeyes got a lot of the chicken buzz in...,11320,13.0%,2470,5.0%,NaN,Quick Service & Chicken
3,4,Taco Bell,NaN,11293,9.0%,6766,2.7%,NaN,Quick Service & Mexican
4,5,Burger King,NaN,10204,2.7%,7346,0.2%,NaN,Quick Service & Burger
...,...,...,...,...,...,...,...,...,...
245,246,Rainforest Cafe,NaN,129,-10.4%,18,-5.3%,NaN,Varied Menu
246,247,PDQ,NaN,127,-5.5%,56,-11.1%,NaN,Chicken
247,248,Lupe Tortilla,NaN,127,12.1%,25,8.7%,NaN,Mexican
248,249,Cook-Out Restaurant,NaN,126,10.1%,270,7.1%,NaN,Burger
249,250,Jollibee,NaN,126,15.2%,40,11.1%,NaN,Chicken

In [84]:
df2.shape

(250, 9)

In [86]:
df2.size

2250

In [85]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Rank              250 non-null    int64
 1   Restaurant        250 non-null    object
 2   Content           33 non-null     object
 3   Sales             250 non-null    int64
 4   YOY_Sales         250 non-null    object
 5   Units             250 non-null    int64
 6   YOY_Units         250 non-null    object
 7   Headquarters      52 non-null     object
 8   Segment_Category  250 non-null    object
dtypes: int64(3), object(6)
memory usage: 17.7+ KB

In [87]:
df2.head()

,Rank,Restaurant,Content,Sales,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
0,1,McDonald's,NaN,40412,4.9%,13846,-0.5%,NaN,Quick Service & Burger
1,2,Starbucks,NaN,21380,8.6%,15049,3.0%,NaN,Quick Service & Coffee Cafe
2,3,Chick-fil-A,While Popeyes got a lot of the chicken buzz in...,11320,13.0%,2470,5.0%,NaN,Quick Service & Chicken
3,4,Taco Bell,NaN,11293,9.0%,6766,2.7%,NaN,Quick Service & Mexican
4,5,Burger King,NaN,10204,2.7%,7346,0.2%,NaN,Quick Service & Burger

In [88]:
df2.describe()

             Rank        Sales         Units
count  250.000000    250.00000    250.000000
mean   125.500000   1242.74000    850.076000
std     72.312977   3365.22882   2296.151659
min      1.000000    126.00000     13.000000
25%     63.250000    181.00000     85.000000
50%    125.500000    330.00000    207.000000
75%    187.750000    724.75000    555.250000
max    250.000000  40412.00000  23801.000000

# HANDLING NULL VALUES

In [90]:
df2.isnull()

,Rank,Restaurant,Content,Sales,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
0,False,False,True,False,False,False,False,True,False
1,False,False,True,False,False,False,False,True,False
2,False,False,False,False,False,False,False,True,False
3,False,False,True,False,False,False,False,True,False
4,False,False,True,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...
245,False,False,True,False,False,False,False,True,False
246,False,False,True,False,False,False,False,True,False
247,False,False,True,False,False,False,False,True,False
248,False,False,True,False,False,False,False,True,False
249,False,False,True,False,False,False,False,True,False

In [92]:
df2.isnull().sum()

Rank                  0
Restaurant            0
Content             217
Sales                 0
YOY_Sales             0
Units                 0
YOY_Units             0
Headquarters        198
Segment_Category      0
dtype: int64

In [93]:
df2.isnull().sum().sum()

415

# DROPPING ROWS WITH NaN VALUES

In [94]:
df2.shape

(250, 9)

In [96]:
df3=df2.dropna()   # default axis=0 
df3

,Rank,Restaurant,Content,Sales,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
65,66,Tim Hortons,On the other side of that equation is Tim Hort...,714,-3.5%,715,-1.7%,"Toronto, ON",Quick Service & Coffee Cafe

In [97]:
df3.head()

,Rank,Restaurant,Content,Sales,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
65,66,Tim Hortons,On the other side of that equation is Tim Hort...,714,-3.5%,715,-1.7%,"Toronto, ON",Quick Service & Coffee Cafe

In [99]:
df3.shape

(1, 9)

# DROPPING COLUMNS WITH NaN VALUES

In [104]:
df4=df2.dropna(axis=1)
df4

,Rank,Restaurant,Sales,YOY_Sales,Units,YOY_Units,Segment_Category
0,1,McDonald's,40412,4.9%,13846,-0.5%,Quick Service & Burger
1,2,Starbucks,21380,8.6%,15049,3.0%,Quick Service & Coffee Cafe
2,3,Chick-fil-A,11320,13.0%,2470,5.0%,Quick Service & Chicken
3,4,Taco Bell,11293,9.0%,6766,2.7%,Quick Service & Mexican
4,5,Burger King,10204,2.7%,7346,0.2%,Quick Service & Burger
...,...,...,...,...,...,...,...
245,246,Rainforest Cafe,129,-10.4%,18,-5.3%,Varied Menu
246,247,PDQ,127,-5.5%,56,-11.1%,Chicken
247,248,Lupe Tortilla,127,12.1%,25,8.7%,Mexican
248,249,Cook-Out Restaurant,126,10.1%,270,7.1%,Burger
249,250,Jollibee,126,15.2%,40,11.1%,Chicken

In [105]:
df4.shape

(250, 7)

In [107]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Rank              250 non-null    int64
 1   Restaurant        250 non-null    object
 2   Sales             250 non-null    int64
 3   YOY_Sales         250 non-null    object
 4   Units             250 non-null    int64
 5   YOY_Units         250 non-null    object
 6   Segment_Category  250 non-null    object
dtypes: int64(3), object(4)
memory usage: 13.8+ KB

In [112]:
df2.dropna(how='any')  #if any row value is null then remove that row

,Rank,Restaurant,Content,Sales,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
65,66,Tim Hortons,On the other side of that equation is Tim Hort...,714,-3.5%,715,-1.7%,"Toronto, ON",Quick Service & Coffee Cafe

In [115]:
df5=df2.dropna(how='all')   # if all row values is null then remove that row

In [116]:
df5

,Rank,Restaurant,Content,Sales,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
0,1,McDonald's,NaN,40412,4.9%,13846,-0.5%,NaN,Quick Service & Burger
1,2,Starbucks,NaN,21380,8.6%,15049,3.0%,NaN,Quick Service & Coffee Cafe
2,3,Chick-fil-A,While Popeyes got a lot of the chicken buzz in...,11320,13.0%,2470,5.0%,NaN,Quick Service & Chicken
3,4,Taco Bell,NaN,11293,9.0%,6766,2.7%,NaN,Quick Service & Mexican
4,5,Burger King,NaN,10204,2.7%,7346,0.2%,NaN,Quick Service & Burger
...,...,...,...,...,...,...,...,...,...
245,246,Rainforest Cafe,NaN,129,-10.4%,18,-5.3%,NaN,Varied Menu
246,247,PDQ,NaN,127,-5.5%,56,-11.1%,NaN,Chicken
247,248,Lupe Tortilla,NaN,127,12.1%,25,8.7%,NaN,Mexican
248,249,Cook-Out Restaurant,NaN,126,10.1%,270,7.1%,NaN,Burger
249,250,Jollibee,NaN,126,15.2%,40,11.1%,NaN,Chicken

In [117]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Rank              250 non-null    int64
 1   Restaurant        250 non-null    object
 2   Content           33 non-null     object
 3   Sales             250 non-null    int64
 4   YOY_Sales         250 non-null    object
 5   Units             250 non-null    int64
 6   YOY_Units         250 non-null    object
 7   Headquarters      52 non-null     object
 8   Segment_Category  250 non-null    object
dtypes: int64(3), object(6)
memory usage: 17.7+ KB

In [118]:
df2.dropna(inplace=True)

In [120]:
df2.shape

(1, 9)